server/app/controllers/auth_controller.rb

  def register
    user = User.new(email: params[:email], password: params[:password])
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2025-08-14 18:20:09.172979"], ["updated_at", "2025-08-14 18:20:09.172979"]]

  def login
    user = User.find_by(email: params[:email].to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]