server/app/controllers/graphql_controller.rb

  def execute
    if params[:query]&.include?("budgets")
---
SELECT "budgets".* FROM "budgets"